Revit 2027 API
ParameterTypeId.ProjectBuildingType Property
 "Building Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId ProjectBuildingType { get; }
Public Shared ReadOnly Property ProjectBuildingType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ ProjectBuildingType {
	ForgeTypeId^ get ();
}
static member ProjectBuildingType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace